{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "Contexts",
			"Children": [
				{
					"Source":
					{
						"Text": "GameplayTag Macro Generator"
					},
					"Translation":
					{
						"Text": "GameplayTag 宏生成器"
					},
					"Key": "GameplayTagMacroGenerator"
				}
			]
		},
		{
			"Namespace": "FGameplayTagMacroGeneratorModule",
			"Children": [
				{
					"Source":
					{
						"Text": "C++ macro file output path cannot be empty. \nPlease check Project Settings - Gameplay Tag Macro Generator - Cpp Macro File Output Path."
					},
					"Translation":
					{
						"Text": "宏文件输出路径不能为空。请检查项目设置 - Ganeplay Tag Macro Generator - 设置 - Cpp Macro File Output Path。"
					},
					"Key": "CppMacroFileOutputPathIsEmpty"
				},
				{
					"Source":
					{
						"Text": "C++ macro file output path not exists. \nPlease check Project Settings - Gameplay Tag Macro Generator - Cpp Macro File Output Path."
					},
					"Translation":
					{
						"Text": "宏文件输出路径不存在。请检查项目设置 - Ganeplay Tag Macro Generator - 设置 - Cpp Macro File Output Path。"
					},
					"Key": "CppMacroFileOutputPathNotExists"
				},
				{
					"Source":
					{
						"Text": "GameplayTag Macro Generator"
					},
					"Translation":
					{
						"Text": "GameplayTag 宏生成器"
					},
					"Key": "GameplayTagMacroGenerator"
				},
				{
					"Source":
					{
						"Text": "GameplayTag Macro Generator."
					},
					"Translation":
					{
						"Text": "GameplayTag 宏生成器。"
					},
					"Key": "GameplayTagMacroGeneratorSettingDescription"
				},
				{
					"Source":
					{
						"Text": "GameplayTagTableList and GameplayTagList are all empty. \nPlease check Project Settings - Project - GameplayTags."
					},
					"Translation":
					{
						"Text": "GameplayTagTableList 和 GameplayTagList 都是空的。请检查项目设置 - 项目 - GameplayTags。"
					},
					"Key": "GameplayTagIsEmpty"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "FGameplayTagMacroGeneratorModule",
					"Children": [
						{
							"Source":
							{
								"Text": "Generate GameplayTag Macro"
							},
							"Translation":
							{
								"Text": "生成 GameplayTag 宏"
							},
							"Key": "PluginAction_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Generate GameplayTag Macro"
							},
							"Translation":
							{
								"Text": "生成 GameplayTag 宏"
							},
							"Key": "PluginAction"
						}
					]
				}
			]
		}
	]
}